emacs/configs/programming/02-web.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf7cd6ee">1. Web Development Configuration</a>
<ul>
<li><a href="#org5b392ba">1.1. Overview</a></li>
<li><a href="#org98b4e99">1.2. Key Features</a>
<ul>
<li><a href="#org2488036">1.2.1. Smart Mode Selection</a></li>
<li><a href="#org789ac5e">1.2.2. Supported File Types</a></li>
<li><a href="#org00b2206">1.2.3. Development Tools</a></li>
</ul>
</li>
<li><a href="#org55af314">1.3. Web</a>
<ul>
<li><a href="#orgc719f1b">1.3.1. Required Local Dependencies</a></li>
<li><a href="#org7d81ba6">1.3.2. Emacs Packages</a></li>
<li><a href="#orga9c6119">1.3.3. Key Bindings</a></li>
<li><a href="#org2b5caa8">1.3.4. Workflow Examples</a></li>
<li><a href="#orgc2fa64f">1.3.5. Project Structure Recommendations</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf7cd6ee" class="outline-2">
<h2 id="orgf7cd6ee"><span class="section-number-2">1.</span> Web Development Configuration</h2>
<div class="outline-text-2" id="text-1">
<p>
Configuration for modern web development including HTML, CSS, JavaScript, TypeScript, and frameworks.
</p>
</div>

<div id="outline-container-org5b392ba" class="outline-3">
<h3 id="org5b392ba"><span class="section-number-3">1.1.</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This module provides comprehensive support for:
</p>
<ul class="org-ul">
<li><b><b>HTML</b></b>: Multiple modes (web-mode, mhtml-mode) with smart selection</li>
<li><b><b>CSS</b></b>: Enhanced editing with completion and formatting</li>
<li><b><b>JavaScript</b></b>: Modern JS/JSX with proper indentation and tooling</li>
<li><b><b>TypeScript</b></b>: Full TypeScript and TSX support</li>
<li><b><b>Frameworks</b></b>: React, Vue, Svelte, Angular</li>
<li><b><b>Tools</b></b>: ESLint, Prettier, Language Server Protocol (LSP)</li>
<li><b><b>Build Tools</b></b>: npm, yarn, webpack integration</li>
</ul>
</div>
</div>

<div id="outline-container-org98b4e99" class="outline-3">
<h3 id="org98b4e99"><span class="section-number-3">1.2.</span> Key Features</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org2488036" class="outline-4">
<h4 id="org2488036"><span class="section-number-4">1.2.1.</span> Smart Mode Selection</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Automatically chooses the best HTML mode based on file size:
</p>
<ul class="org-ul">
<li>Small files (&lt; 5000 lines): <code>web-mode</code> for rich features</li>
<li>Large files (≥ 5000 lines): <code>mhtml-mode</code> for performance</li>
</ul>
</div>
</div>

<div id="outline-container-org789ac5e" class="outline-4">
<h4 id="org789ac5e"><span class="section-number-4">1.2.2.</span> Supported File Types</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>HTML, XHTML</li>
<li>JavaScript (.js, .jsx, .mjs)</li>
<li>TypeScript (.ts, .tsx)</li>
<li>Vue (.vue)</li>
<li>Templates (.njk, .hbs, .mustache)</li>
<li>CSS, SCSS, SASS, Less</li>
<li>JSON</li>
</ul>
</div>
</div>

<div id="outline-container-org00b2206" class="outline-4">
<h4 id="org00b2206"><span class="section-number-4">1.2.3.</span> Development Tools</h4>
<div class="outline-text-4" id="text-1-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tool</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>web-mode</code></td>
<td class="org-left">Unified mode for HTML/CSS/JS</td>
</tr>

<tr>
<td class="org-left"><code>emmet-mode</code></td>
<td class="org-left">HTML/CSS abbreviation expansion</td>
</tr>

<tr>
<td class="org-left"><code>tagedit</code></td>
<td class="org-left">Paredit-like editing for HTML tags</td>
</tr>

<tr>
<td class="org-left"><code>prettier-js</code></td>
<td class="org-left">Code formatting</td>
</tr>

<tr>
<td class="org-left"><code>eslint</code></td>
<td class="org-left">JavaScript linting</td>
</tr>

<tr>
<td class="org-left"><code>lsp-mode</code></td>
<td class="org-left">Language Server Protocol support</td>
</tr>

<tr>
<td class="org-left"><code>typescript-mode</code></td>
<td class="org-left">TypeScript language support</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
