content/emacs/configs/programming/02-web.org
** Web
#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/prog-web-conf.el
  ;;; prog-web-conf.el --- Web development configuration -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Configuration for web development including HTML, CSS, JavaScript,
  ;;; TypeScript, React/JSX, and related tools.
  ;;; Code:

  ;; HTML tag editing
  (use-package tagedit
    :hook
    ((mhtml-mode
  	sgml-mode
  	nxml-mode)
     . (lambda ()
  	   (tagedit-add-paredit-like-keybindings)
  	   (tagedit-mode 1))))

  (use-package emmet-mode
    :hook (mhtml-mode sgml-mode nxml-mode))

  ;; Smart HTML mode selection
  (defun fu-html-mode-selector ()
    "Choose between web-mode and mhtml-mode based on file size.
  Use mhtml-mode for files larger than 5000 lines to prevent hanging."
    (let* ((file (buffer-file-name))
           (size-threshold 5000))
      (when (and file (file-exists-p file))
        (let ((line-count (count-lines (point-min) (point-max))))
          (if (> line-count size-threshold)
              (progn
                (message "Large HTML file (%d lines) detected, using mhtml-mode for performance" line-count)
                (mhtml-mode))
            (web-mode))))))

  ;; Register HTML files to use smart mode selector
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . fu-html-mode-selector))

  ;; web-mode: powerful mode for HTML, JSX, TSX, Vue, etc.
  (use-package web-mode
    :mode (("\\.jsx?\\'" . web-mode)
           ("\\.tsx?\\'" . web-mode)
           ("\\.vue\\'" . web-mode)
           ("\\.njk\\'" . web-mode)
           ("\\.hbs\\'" . web-mode)
           ("\\.mustache\\'" . web-mode))
    :custom
    ;; Indentation
    (web-mode-markup-indent-offset 2)
    (web-mode-css-indent-offset 2)
    (web-mode-code-indent-offset 2)
    (web-mode-style-padding 2)
    (web-mode-script-padding 2)
    (web-mode-block-padding 0)

    ;; Syntax highlighting
    (web-mode-enable-css-colorization t)
    (web-mode-enable-auto-pairing t)
    (web-mode-enable-comment-keywords t)
    (web-mode-enable-current-element-highlight t)
    (web-mode-enable-current-column-highlight nil)

    ;; Content types
    (web-mode-content-types-alist
     '(("jsx" . "\\.js[x]?\\'")
       ("tsx" . "\\.ts[x]?\\'")))

    ;; Auto-close tags
    (web-mode-enable-auto-closing t)
    (web-mode-enable-auto-quoting t)

    ;; Comments
    (web-mode-comment-style 2)

    :config
    ;; Remove background colors from web-mode faces to use theme's default
    (set-face-attribute 'web-mode-block-face nil :background nil)
    (set-face-attribute 'web-mode-script-face nil :background nil)
    (set-face-attribute 'web-mode-style-face nil :background nil)
    (set-face-attribute 'web-mode-part-face nil :background nil)

    ;; Better JSX/TSX detection
    (defun fu-web-mode-hook ()
      "Hooks for Web mode."
      (setq web-mode-enable-part-face nil)
      (when (string-match-p "\\.[jt]sx?\\'" (buffer-file-name))
        (setq-local web-mode-content-type "jsx")
        (setq-local web-mode-enable-auto-indentation t)))

    (add-hook 'web-mode-hook #'fu-web-mode-hook))

  ;; Eglot configuration for web-mode
  (with-eval-after-load 'eglot
    (defun fu-eglot-web-mode-server (&optional interactive)
      "Return appropriate language server for web-mode based on file extension.
  INTERACTIVE is passed by Eglot but not used here."
      (let ((file (buffer-file-name)))
        (cond
         ((and file (string-match-p "\\.tsx?\\'" file))
          '("typescript-language-server" "--stdio"))
         ((and file (string-match-p "\\.jsx?\\'" file))
          '("typescript-language-server" "--stdio"))
         (t
          '("vscode-html-language-server" "--stdio")))))

    ;; Configure web-mode server selection with smart detection
    (add-to-list 'eglot-server-programs
                 '(web-mode . fu-eglot-web-mode-server))

    ;; Add eglot hooks for web modes
    (add-hook 'mhtml-mode-hook #'eglot-ensure)
    (add-hook 'web-mode-hook #'eglot-ensure)
    (add-hook 'css-mode-hook #'eglot-ensure)
    (add-hook 'scss-mode-hook #'eglot-ensure)
    (add-hook 'js-mode-hook #'eglot-ensure)
    (add-hook 'js2-mode-hook #'eglot-ensure)
    (add-hook 'js-ts-mode-hook #'eglot-ensure)
    (add-hook 'rjsx-mode-hook #'eglot-ensure)
    (add-hook 'typescript-mode-hook #'eglot-ensure)
    (add-hook 'typescript-ts-mode-hook #'eglot-ensure)
    (add-hook 'tsx-ts-mode-hook #'eglot-ensure)
    (add-hook 'json-mode-hook #'eglot-ensure))

  ;; js2-mode: enhanced JavaScript editing
  (use-package js2-mode
    :mode "\\.m?js\\'"
    :interpreter "node"
    :custom
    (js2-basic-offset 2)
    (js2-bounce-indent-p nil)
    (js2-strict-missing-semi-warning nil)
    (js2-missing-semi-one-line-override t)
    (js-indent-level 2)
    :config
    ;; Disable js2-mode's syntax checking in favor of Flymake/LSP
    (setq js2-mode-show-parse-errors nil)
    (setq js2-mode-show-strict-warnings nil))

  ;; rjsx-mode: React JSX support
  (use-package rjsx-mode
    :mode ("components/.*\\.js\\'" "\\.jsx\\'")
    :custom
    (js2-basic-offset 2)
    (js2-strict-missing-semi-warning nil))

  (use-package typescript-mode
    :mode "\\.ts\\'"
    :custom
    (typescript-indent-level 2))

  ;; TypeScript TSX mode
  (use-package tsx-mode
    :ensure nil
    :mode "\\.tsx\\'"
    :config
    (add-to-list 'auto-mode-alist '("\\.tsx\\'" . tsx-ts-mode)))

  ;; JSON mode
  (use-package json-mode
    :mode "\\.json\\'"
    :custom
    (json-reformat:indent-width 2)
    (js-indent-level 2))

  ;; CSS/SCSS modes
  (use-package css-mode
    :ensure nil
    :mode "\\.css\\'"
    :custom
    (css-indent-offset 2))

  (use-package scss-mode
    :mode "\\.scss\\'"
    :custom
    (css-indent-offset 2))

  ;; Add node_modules/.bin to exec-path
  (use-package add-node-modules-path
    :hook ((web-mode . add-node-modules-path)
           (js-mode . add-node-modules-path)
           (js2-mode . add-node-modules-path)
           (rjsx-mode . add-node-modules-path)
           (typescript-mode . add-node-modules-path)
           (typescript-ts-mode . add-node-modules-path)
           (tsx-ts-mode . add-node-modules-path)))

  ;; npm/yarn integration
  (use-package npm-mode
    :commands (npm-mode)
    :hook ((web-mode . npm-mode)
           (js-mode . npm-mode)
           (js2-mode . npm-mode)
           (typescript-mode . npm-mode))
    :init
    (defun fu-npm-mode-keybindings ()
      "Set up npm-mode keybindings."
      (when (boundp 'npm-mode-command-keymap)
        (define-key npm-mode-command-keymap "n" 'npm-mode-npm-run)
        (define-key npm-mode-command-keymap "i" 'npm-mode-npm-install)
        (define-key npm-mode-command-keymap "t" 'npm-mode-npm-test)
        (define-key npm-mode-command-keymap "b" 'npm-mode-npm-build)))
    (add-hook 'npm-mode-hook 'fu-npm-mode-keybindings))

  ;; Prettier formatting
  (use-package prettier
    :commands (prettier-prettify)
    :custom
    (prettier-pre-warm 'full))

  ;; ESLint integration via Flymake
  (use-package flymake-eslint
    :hook ((js-mode . flymake-eslint-enable)
           (js2-mode . flymake-eslint-enable)
           (rjsx-mode . flymake-eslint-enable)
           (typescript-mode . flymake-eslint-enable)
           (typescript-ts-mode . flymake-eslint-enable)
           (tsx-ts-mode . flymake-eslint-enable)
           (web-mode . flymake-eslint-enable)))

  ;; Import JavaScript modules
  (use-package js-import
    :after js
    :config
    (define-key js-mode-map (kbd "C-c i i") 'js-import)
    (define-key js-mode-map (kbd "C-c i f") 'js-import-from-file))

  ;; Run Jest tests
  (use-package jest
    :commands (jest jest-popup)
    :custom
    (jest-executable "npx jest")
    :config
    (with-eval-after-load 'js
      (define-key js-mode-map (kbd "C-c t j") 'jest)
      (define-key js-mode-map (kbd "C-c t p") 'jest-popup)))

  ;; Indium: JavaScript debugging via Chrome DevTools Protocol
  (use-package indium
    :commands (indium-connect indium-launch indium-interaction-mode)
    :hook ((js-mode . indium-interaction-mode)
           (js2-mode . indium-interaction-mode)
           (rjsx-mode . indium-interaction-mode))
    :custom
    (indium-chrome-executable
     (cond
      ((eq system-type 'darwin)
       "/Applications/Google Chrome.app/Contents/MacOS/Google Chrome")
      ((eq system-type 'windows-nt)
       "C:/Program Files/Google/Chrome/Application/chrome.exe")
      (t "google-chrome")))
    :config
    (with-eval-after-load 'indium-interaction
      (define-key indium-interaction-mode-map (kbd "C-c C-c") 'indium-eval-defun)
      (define-key indium-interaction-mode-map (kbd "C-c C-e") 'indium-eval-last-node)
      (define-key indium-interaction-mode-map (kbd "C-c C-r") 'indium-eval-region)
      (define-key indium-interaction-mode-map (kbd "C-c C-b") 'indium-toggle-breakpoint)
      (define-key indium-interaction-mode-map (kbd "C-c C-l") 'indium-list-breakpoints)))

  ;; Skewer: Live web development
  (use-package skewer-mode
    :commands (skewer-mode run-skewer skewer-css-mode skewer-html-mode)
    :hook ((js-mode . skewer-mode)
           (css-mode . skewer-css-mode)
           (web-mode . skewer-html-mode))
    :config
    (with-eval-after-load 'skewer-mode
      (define-key skewer-mode-map (kbd "C-c C-k") 'skewer-load-buffer)
      (define-key skewer-mode-map (kbd "C-c C-e") 'skewer-eval-last-expression)
      (define-key skewer-mode-map (kbd "C-c C-r") 'skewer-eval-region)))

  ;; Simple-httpd: built-in web server
  (use-package simple-httpd
    :commands (httpd-start httpd-stop)
    :custom
    (httpd-port 8000)
    (httpd-host "localhost"))

  (provide 'prog-web-conf)
  ;;; prog-web-conf.el ends here
#+end_src

