emacs/configs/programming/02-web.html

<div id="outline-container-org55af314" class="outline-3">
<h3 id="org55af314"><span class="section-number-3">1.3.</span> Web</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">prog-web-conf.el --- Web development configuration -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Configuration for web development including HTML, CSS, JavaScript,
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">TypeScript, React/JSX, and related tools.
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">HTML tag editing
</span>(<span class="org-keyword">use-package</span> tagedit
  <span class="org-builtin">:hook</span>
  ((mhtml-mode
      sgml-mode
      nxml-mode)
   . (<span class="org-keyword">lambda</span> ()
         (tagedit-add-paredit-like-keybindings)
         (tagedit-mode 1))))

(<span class="org-keyword">use-package</span> emmet-mode
  <span class="org-builtin">:hook</span> (mhtml-mode sgml-mode nxml-mode))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Smart HTML mode selection
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">fu-html-mode-selector</span> ()
  <span class="org-doc">"Choose between web-mode and mhtml-mode based on file size.
Use mhtml-mode for files larger than 5000 lines to prevent hanging."</span>
  (<span class="org-keyword">let*</span> ((file (buffer-file-name))
         (size-threshold 5000))
    (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> file (file-exists-p file))
      (<span class="org-keyword">let</span> ((line-count (count-lines (point-min) (point-max))))
        (<span class="org-keyword">if</span> (&gt; line-count size-threshold)
            (<span class="org-keyword">progn</span>
              (message <span class="org-string">"Large HTML file (%d lines) detected, using mhtml-mode for performance"</span> line-count)
              (mhtml-mode))
          (web-mode))))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Register HTML files to use smart mode selector
</span>(add-to-list 'auto-mode-alist '(<span class="org-string">"\\.html?\\'"</span> . fu-html-mode-selector))

<span class="org-comment-delimiter">;; </span><span class="org-comment">web-mode: powerful mode for HTML, JSX, TSX, Vue, etc.
</span>(<span class="org-keyword">use-package</span> web-mode
  <span class="org-builtin">:mode</span> ((<span class="org-string">"\\.jsx?\\'"</span> . web-mode)
         (<span class="org-string">"\\.tsx?\\'"</span> . web-mode)
         (<span class="org-string">"\\.vue\\'"</span> . web-mode)
         (<span class="org-string">"\\.njk\\'"</span> . web-mode)
         (<span class="org-string">"\\.hbs\\'"</span> . web-mode)
         (<span class="org-string">"\\.mustache\\'"</span> . web-mode))
  <span class="org-builtin">:custom</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Indentation
</span>  (web-mode-markup-indent-offset 2)
  (web-mode-css-indent-offset 2)
  (web-mode-code-indent-offset 2)
  (web-mode-style-padding 2)
  (web-mode-script-padding 2)
  (web-mode-block-padding 0)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Syntax highlighting
</span>  (web-mode-enable-css-colorization t)
  (web-mode-enable-auto-pairing t)
  (web-mode-enable-comment-keywords t)
  (web-mode-enable-current-element-highlight t)
  (web-mode-enable-current-column-highlight nil)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Content types
</span>  (web-mode-content-types-alist
   '((<span class="org-string">"jsx"</span> . <span class="org-string">"\\.js[x]?\\'"</span>)
     (<span class="org-string">"tsx"</span> . <span class="org-string">"\\.ts[x]?\\'"</span>)))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Auto-close tags
</span>  (web-mode-enable-auto-closing t)
  (web-mode-enable-auto-quoting t)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Comments
</span>  (web-mode-comment-style 2)

  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Remove background colors from web-mode faces to use theme's default
</span>  (set-face-attribute 'web-mode-block-face nil <span class="org-builtin">:background</span> nil)
  (set-face-attribute 'web-mode-script-face nil <span class="org-builtin">:background</span> nil)
  (set-face-attribute 'web-mode-style-face nil <span class="org-builtin">:background</span> nil)
  (set-face-attribute 'web-mode-part-face nil <span class="org-builtin">:background</span> nil)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Better JSX/TSX detection
</span>  (<span class="org-keyword">defun</span> <span class="org-function-name">fu-web-mode-hook</span> ()
    <span class="org-doc">"Hooks for Web mode."</span>
    (<span class="org-keyword">setq</span> web-mode-enable-part-face nil)
    (<span class="org-keyword">when</span> (string-match-p <span class="org-string">"\\.[jt]sx?\\'"</span> (buffer-file-name))
      (<span class="org-keyword">setq-local</span> web-mode-content-type <span class="org-string">"jsx"</span>)
      (<span class="org-keyword">setq-local</span> web-mode-enable-auto-indentation t)))

  (add-hook 'web-mode-hook #'fu-web-mode-hook))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Eglot configuration for web-mode
</span>(<span class="org-keyword">with-eval-after-load</span> 'eglot
  (<span class="org-keyword">defun</span> <span class="org-function-name">fu-eglot-web-mode-server</span> (<span class="org-type">&amp;optional</span> interactive)
    <span class="org-doc">"Return appropriate language server for web-mode based on file extension.
INTERACTIVE is passed by Eglot but not used here."</span>
    (<span class="org-keyword">let</span> ((file (buffer-file-name)))
      (<span class="org-keyword">cond</span>
       ((<span class="org-keyword">and</span> file (string-match-p <span class="org-string">"\\.tsx?\\'"</span> file))
        '(<span class="org-string">"typescript-language-server"</span> <span class="org-string">"--stdio"</span>))
       ((<span class="org-keyword">and</span> file (string-match-p <span class="org-string">"\\.jsx?\\'"</span> file))
        '(<span class="org-string">"typescript-language-server"</span> <span class="org-string">"--stdio"</span>))
       (t
        '(<span class="org-string">"vscode-html-language-server"</span> <span class="org-string">"--stdio"</span>)))))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Configure web-mode server selection with smart detection
</span>  (add-to-list 'eglot-server-programs
               '(web-mode . fu-eglot-web-mode-server))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Add eglot hooks for web modes
</span>  (add-hook 'mhtml-mode-hook #'eglot-ensure)
  (add-hook 'web-mode-hook #'eglot-ensure)
  (add-hook 'css-mode-hook #'eglot-ensure)
  (add-hook 'scss-mode-hook #'eglot-ensure)
  (add-hook 'js-mode-hook #'eglot-ensure)
  (add-hook 'js2-mode-hook #'eglot-ensure)
  (add-hook 'js-ts-mode-hook #'eglot-ensure)
  (add-hook 'rjsx-mode-hook #'eglot-ensure)
  (add-hook 'typescript-mode-hook #'eglot-ensure)
  (add-hook 'typescript-ts-mode-hook #'eglot-ensure)
  (add-hook 'tsx-ts-mode-hook #'eglot-ensure)
  (add-hook 'json-mode-hook #'eglot-ensure))

<span class="org-comment-delimiter">;; </span><span class="org-comment">js2-mode: enhanced JavaScript editing
</span>(<span class="org-keyword">use-package</span> js2-mode
  <span class="org-builtin">:mode</span> <span class="org-string">"\\.m?js\\'"</span>
  <span class="org-builtin">:interpreter</span> <span class="org-string">"node"</span>
  <span class="org-builtin">:custom</span>
  (js2-basic-offset 2)
  (js2-bounce-indent-p nil)
  (js2-strict-missing-semi-warning nil)
  (js2-missing-semi-one-line-override t)
  (js-indent-level 2)
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Disable js2-mode's syntax checking in favor of Flymake/LSP
</span>  (<span class="org-keyword">setq</span> js2-mode-show-parse-errors nil)
  (<span class="org-keyword">setq</span> js2-mode-show-strict-warnings nil))

<span class="org-comment-delimiter">;; </span><span class="org-comment">rjsx-mode: React JSX support
</span>(<span class="org-keyword">use-package</span> rjsx-mode
  <span class="org-builtin">:mode</span> (<span class="org-string">"components/.*\\.js\\'"</span> <span class="org-string">"\\.jsx\\'"</span>)
  <span class="org-builtin">:custom</span>
  (js2-basic-offset 2)
  (js2-strict-missing-semi-warning nil))

(<span class="org-keyword">use-package</span> typescript-mode
  <span class="org-builtin">:mode</span> <span class="org-string">"\\.ts\\'"</span>
  <span class="org-builtin">:custom</span>
  (typescript-indent-level 2))

<span class="org-comment-delimiter">;; </span><span class="org-comment">TypeScript TSX mode
</span>(<span class="org-keyword">use-package</span> tsx-mode
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:mode</span> <span class="org-string">"\\.tsx\\'"</span>
  <span class="org-builtin">:config</span>
  (add-to-list 'auto-mode-alist '(<span class="org-string">"\\.tsx\\'"</span> . tsx-ts-mode)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">JSON mode
</span>(<span class="org-keyword">use-package</span> json-mode
  <span class="org-builtin">:mode</span> <span class="org-string">"\\.json\\'"</span>
  <span class="org-builtin">:custom</span>
  (json-reformat:indent-width 2)
  (js-indent-level 2))

<span class="org-comment-delimiter">;; </span><span class="org-comment">CSS/SCSS modes
</span>(<span class="org-keyword">use-package</span> css-mode
  <span class="org-builtin">:ensure</span> nil
  <span class="org-builtin">:mode</span> <span class="org-string">"\\.css\\'"</span>
  <span class="org-builtin">:custom</span>
  (css-indent-offset 2))

(<span class="org-keyword">use-package</span> scss-mode
  <span class="org-builtin">:mode</span> <span class="org-string">"\\.scss\\'"</span>
  <span class="org-builtin">:custom</span>
  (css-indent-offset 2))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Add node_modules/.bin to exec-path
</span>(<span class="org-keyword">use-package</span> add-node-modules-path
  <span class="org-builtin">:hook</span> ((web-mode . add-node-modules-path)
         (js-mode . add-node-modules-path)
         (js2-mode . add-node-modules-path)
         (rjsx-mode . add-node-modules-path)
         (typescript-mode . add-node-modules-path)
         (typescript-ts-mode . add-node-modules-path)
         (tsx-ts-mode . add-node-modules-path)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">npm/yarn integration
</span>(<span class="org-keyword">use-package</span> npm-mode
  <span class="org-builtin">:commands</span> (npm-mode)
  <span class="org-builtin">:hook</span> ((web-mode . npm-mode)
         (js-mode . npm-mode)
         (js2-mode . npm-mode)
         (typescript-mode . npm-mode))
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">defun</span> <span class="org-function-name">fu-npm-mode-keybindings</span> ()
    <span class="org-doc">"Set up npm-mode keybindings."</span>
    (<span class="org-keyword">when</span> (boundp 'npm-mode-command-keymap)
      (define-key npm-mode-command-keymap <span class="org-string">"n"</span> 'npm-mode-npm-run)
      (define-key npm-mode-command-keymap <span class="org-string">"i"</span> 'npm-mode-npm-install)
      (define-key npm-mode-command-keymap <span class="org-string">"t"</span> 'npm-mode-npm-test)
      (define-key npm-mode-command-keymap <span class="org-string">"b"</span> 'npm-mode-npm-build)))
  (add-hook 'npm-mode-hook 'fu-npm-mode-keybindings))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Prettier formatting
</span>(<span class="org-keyword">use-package</span> prettier
  <span class="org-builtin">:commands</span> (prettier-prettify)
  <span class="org-builtin">:custom</span>
  (prettier-pre-warm 'full))

<span class="org-comment-delimiter">;; </span><span class="org-comment">ESLint integration via Flymake
</span>(<span class="org-keyword">use-package</span> flymake-eslint
  <span class="org-builtin">:hook</span> ((js-mode . flymake-eslint-enable)
         (js2-mode . flymake-eslint-enable)
         (rjsx-mode . flymake-eslint-enable)
         (typescript-mode . flymake-eslint-enable)
         (typescript-ts-mode . flymake-eslint-enable)
         (tsx-ts-mode . flymake-eslint-enable)
         (web-mode . flymake-eslint-enable)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Import JavaScript modules
</span>(<span class="org-keyword">use-package</span> js-import
  <span class="org-builtin">:after</span> js
  <span class="org-builtin">:config</span>
  (define-key js-mode-map (kbd <span class="org-string">"C-c i i"</span>) 'js-import)
  (define-key js-mode-map (kbd <span class="org-string">"C-c i f"</span>) 'js-import-from-file))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Run Jest tests
</span>(<span class="org-keyword">use-package</span> jest
  <span class="org-builtin">:commands</span> (jest jest-popup)
  <span class="org-builtin">:custom</span>
  (jest-executable <span class="org-string">"npx jest"</span>)
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">with-eval-after-load</span> 'js
    (define-key js-mode-map (kbd <span class="org-string">"C-c t j"</span>) 'jest)
    (define-key js-mode-map (kbd <span class="org-string">"C-c t p"</span>) 'jest-popup)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Indium: JavaScript debugging via Chrome DevTools Protocol
</span>(<span class="org-keyword">use-package</span> indium
  <span class="org-builtin">:commands</span> (indium-connect indium-launch indium-interaction-mode)
  <span class="org-builtin">:hook</span> ((js-mode . indium-interaction-mode)
         (js2-mode . indium-interaction-mode)
         (rjsx-mode . indium-interaction-mode))
  <span class="org-builtin">:custom</span>
  (indium-chrome-executable
   (<span class="org-keyword">cond</span>
    ((eq system-type 'darwin)
     <span class="org-string">"/Applications/Google Chrome.app/Contents/MacOS/Google Chrome"</span>)
    ((eq system-type 'windows-nt)
     <span class="org-string">"C:/Program Files/Google/Chrome/Application/chrome.exe"</span>)
    (t <span class="org-string">"google-chrome"</span>)))
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">with-eval-after-load</span> 'indium-interaction
    (define-key indium-interaction-mode-map (kbd <span class="org-string">"C-c C-c"</span>) 'indium-eval-defun)
    (define-key indium-interaction-mode-map (kbd <span class="org-string">"C-c C-e"</span>) 'indium-eval-last-node)
    (define-key indium-interaction-mode-map (kbd <span class="org-string">"C-c C-r"</span>) 'indium-eval-region)
    (define-key indium-interaction-mode-map (kbd <span class="org-string">"C-c C-b"</span>) 'indium-toggle-breakpoint)
    (define-key indium-interaction-mode-map (kbd <span class="org-string">"C-c C-l"</span>) 'indium-list-breakpoints)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Skewer: Live web development
</span>(<span class="org-keyword">use-package</span> skewer-mode
  <span class="org-builtin">:commands</span> (skewer-mode run-skewer skewer-css-mode skewer-html-mode)
  <span class="org-builtin">:hook</span> ((js-mode . skewer-mode)
         (css-mode . skewer-css-mode)
         (web-mode . skewer-html-mode))
  <span class="org-builtin">:config</span>
  (<span class="org-keyword">with-eval-after-load</span> 'skewer-mode
    (define-key skewer-mode-map (kbd <span class="org-string">"C-c C-k"</span>) 'skewer-load-buffer)
    (define-key skewer-mode-map (kbd <span class="org-string">"C-c C-e"</span>) 'skewer-eval-last-expression)
    (define-key skewer-mode-map (kbd <span class="org-string">"C-c C-r"</span>) 'skewer-eval-region)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Simple-httpd: built-in web server
</span>(<span class="org-keyword">use-package</span> simple-httpd
  <span class="org-builtin">:commands</span> (httpd-start httpd-stop)
  <span class="org-builtin">:custom</span>
  (httpd-port 8000)
  (httpd-host <span class="org-string">"localhost"</span>))

(<span class="org-keyword">provide</span> '<span class="org-constant">prog-web-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">prog-web-conf.el ends here</span>
</pre>
</div>
</div>
