content/emacs/configs/programming/02-web.org
*** Required Local Dependencies
**** Language Servers for Eglot
#+begin_example
  # TypeScript/JavaScript Language Server
  npm install -g typescript typescript-language-server

  # HTML/CSS/JSON Language Servers (vscode-langservers-extracted)
  npm install -g vscode-langservers-extracted

  # Tailwind CSS Language Server (optional, for Tailwind projects)
  npm install -g @tailwindcss/language-server
#+end_example

**** Code Formatting and Linting
#+begin_example
  # Prettier (code formatter)
  npm install -g prettier

  # ESLint (JavaScript/TypeScript linter)
  npm install -g eslint

  # For project-specific configs, install locally:
  # npm install --save-dev prettier eslint eslint-config-prettier
#+end_example

**** Debugging Tools
#+begin_example
  # Chrome/Chromium browser for Indium debugging
  # macOS: Install Google Chrome from https://www.google.com/chrome/
  # Windows: Install Google Chrome from https://www.google.com/chrome/
  # Linux: sudo apt install google-chrome-stable
#+end_example

*** Emacs Packages

All packages are installed automatically via use-package. Key packages include:

- *web-mode*: Universal mode for HTML, JSX, TSX, Vue
- *js2-mode*: Enhanced JavaScript editing
- *rjsx-mode*: React JSX support
- *typescript-mode*: TypeScript support
- *prettier*: Code formatting
- *flymake-eslint*: ESLint integration
- *npm-mode*: npm/yarn command integration
- *add-node-modules-path*: Automatic project-local tool detection
- *indium*: Chrome DevTools debugging (alternative to dap-mode)
- *skewer-mode*: Live browser interaction
- *restclient*: HTTP API testing

*** Key Bindings
**** Eglot (LSP) - Available in all web modes
- =C-c l a= - Code actions
- =C-c l o= - Organize imports
- =C-c l r= - Rename symbol
- =C-c l f= - Format buffer/region

**** npm-mode
npm-mode provides a prefix keymap for npm commands. Use =M-x npm-mode-npm-run= or access via the command keymap:
- =n= (in npm-mode-command-keymap) - Run npm script
- =i= (in npm-mode-command-keymap) - npm install
- =t= (in npm-mode-command-keymap) - npm test
- =b= (in npm-mode-command-keymap) - npm build
Or use =M-x npm-mode-npm-run=, =M-x npm-mode-npm-install=, etc. directly

**** Jest Testing
- =C-c t j= - Run Jest tests
- =C-c t p= - Jest test popup

**** JavaScript Import
- =C-c i i= - Import module
- =C-c i f= - Import from file

**** Indium Debugging
- =C-c C-b= - Toggle breakpoint
- =C-c C-c= - Evaluate function
- =C-c C-e= - Evaluate expression
- =C-c C-r= - Evaluate region
- =C-c C-l= - List breakpoints

**** Skewer (Live Development)
- =C-c C-k= - Load buffer to browser
- =C-c C-e= - Evaluate expression in browser
- =C-c C-r= - Evaluate region in browser

*** Workflow Examples
**** Starting a React/Next.js Project
1. Open project in Emacs
2. =M-x npm-mode-npm-install= (or =C-c n i=) to install dependencies
3. =M-x npm-mode-npm-run= (or =C-c n n=) and select "dev" to start dev server
4. Open .jsx or .tsx files - web-mode will activate automatically
5. Eglot will connect to typescript-language-server automatically
6. Prettier will format on save (if enabled in project)

**** Debugging with Indium
1. Start your dev server (e.g., =npm run dev=)
2. =M-x indium-launch= to start Chrome with debugging enabled
3. Set breakpoints with =C-c C-b=
4. Interact with page, debugger will pause at breakpoints
5. Evaluate expressions in context with =C-c C-e=

**** Live Development with Skewer
1. =M-x run-skewer= to start the server
2. Open =http://localhost:8080= in browser
3. Edit HTML/CSS/JS files
4. =C-c C-k= to instantly reload changes in browser

**** Testing APIs with restclient
1. Create a .rest file
2. Write HTTP requests:
   #+begin_example
   GET https://api.example.com/users
   Content-Type: application/json

   ###

   POST https://api.example.com/users
   Content-Type: application/json

   {
     "name": "John Doe",
     "email": "john@example.com"
   }
   #+end_example
3. =C-c C-c= on a request to execute it

*** Project Structure Recommendations

For optimal Emacs integration, use these files in your projects:

**** .prettierrc.json
#+begin_src json
{
  "semi": true,
  "trailingComma": "es5",
  "singleQuote": true,
  "printWidth": 80,
  "tabWidth": 2
}
#+end_src

**** .eslintrc.json
#+begin_src json
{
  "extends": [
    "eslint:recommended",
    "plugin:react/recommended",
    "plugin:@typescript-eslint/recommended",
    "prettier"
  ],
  "parser": "@typescript-eslint/parser",
  "plugins": ["react", "@typescript-eslint"],
  "rules": {
    "react/react-in-jsx-scope": "off"
  }
}
#+end_src

**** tsconfig.json (for TypeScript projects)
#+begin_src json
{
  "compilerOptions": {
    "target": "ES2020",
    "lib": ["ES2020", "DOM"],
    "jsx": "react-jsx",
    "module": "ESNext",
    "moduleResolution": "bundler",
    "strict": true,
    "esModuleInterop": true,
    "skipLibCheck": true
  }
}
#+end_src

