emacs/configs/programming/02-web.html

<div id="outline-container-orgc719f1b" class="outline-4">
<h4 id="orgc719f1b"><span class="section-number-4">1.3.1.</span> Required Local Dependencies</h4>
<div class="outline-text-4" id="text-1-3-1">
</div>
<ol class="org-ol">
<li><a id="orgf130eff"></a>Language Servers for Eglot<br />
<div class="outline-text-5" id="text-1-3-1-1">
<pre class="example" id="org8ffe7cc">
# TypeScript/JavaScript Language Server
npm install -g typescript typescript-language-server

# HTML/CSS/JSON Language Servers (vscode-langservers-extracted)
npm install -g vscode-langservers-extracted

# Tailwind CSS Language Server (optional, for Tailwind projects)
npm install -g @tailwindcss/language-server
</pre>
</div>
</li>

<li><a id="org08ea4e4"></a>Code Formatting and Linting<br />
<div class="outline-text-5" id="text-1-3-1-2">
<pre class="example" id="org42ca472">
# Prettier (code formatter)
npm install -g prettier

# ESLint (JavaScript/TypeScript linter)
npm install -g eslint

# For project-specific configs, install locally:
# npm install --save-dev prettier eslint eslint-config-prettier
</pre>
</div>
</li>

<li><a id="orgdf51cbd"></a>Debugging Tools<br />
<div class="outline-text-5" id="text-1-3-1-3">
<pre class="example" id="orga73a5da">
# Chrome/Chromium browser for Indium debugging
# macOS: Install Google Chrome from https://www.google.com/chrome/
# Windows: Install Google Chrome from https://www.google.com/chrome/
# Linux: sudo apt install google-chrome-stable
</pre>
</div>
</li>
</ol>
</div>

<div id="outline-container-org7d81ba6" class="outline-4">
<h4 id="org7d81ba6"><span class="section-number-4">1.3.2.</span> Emacs Packages</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
All packages are installed automatically via use-package. Key packages include:
</p>

<ul class="org-ul">
<li><b>web-mode</b>: Universal mode for HTML, JSX, TSX, Vue</li>
<li><b>js2-mode</b>: Enhanced JavaScript editing</li>
<li><b>rjsx-mode</b>: React JSX support</li>
<li><b>typescript-mode</b>: TypeScript support</li>
<li><b>prettier</b>: Code formatting</li>
<li><b>flymake-eslint</b>: ESLint integration</li>
<li><b>npm-mode</b>: npm/yarn command integration</li>
<li><b>add-node-modules-path</b>: Automatic project-local tool detection</li>
<li><b>indium</b>: Chrome DevTools debugging (alternative to dap-mode)</li>
<li><b>skewer-mode</b>: Live browser interaction</li>
<li><b>restclient</b>: HTTP API testing</li>
</ul>
</div>
</div>

<div id="outline-container-orga9c6119" class="outline-4">
<h4 id="orga9c6119"><span class="section-number-4">1.3.3.</span> Key Bindings</h4>
<div class="outline-text-4" id="text-1-3-3">
</div>
<ol class="org-ol">
<li><a id="org49debdc"></a>Eglot (LSP) - Available in all web modes<br />
<div class="outline-text-5" id="text-1-3-3-1">
<ul class="org-ul">
<li><code>C-c l a</code> - Code actions</li>
<li><code>C-c l o</code> - Organize imports</li>
<li><code>C-c l r</code> - Rename symbol</li>
<li><code>C-c l f</code> - Format buffer/region</li>
</ul>
</div>
</li>

<li><a id="orgbd4d6ab"></a>npm-mode<br />
<div class="outline-text-5" id="text-1-3-3-2">
<p>
npm-mode provides a prefix keymap for npm commands. Use <code>M-x npm-mode-npm-run</code> or access via the command keymap:
</p>
<ul class="org-ul">
<li><code>n</code> (in npm-mode-command-keymap) - Run npm script</li>
<li><code>i</code> (in npm-mode-command-keymap) - npm install</li>
<li><code>t</code> (in npm-mode-command-keymap) - npm test</li>
<li><code>b</code> (in npm-mode-command-keymap) - npm build</li>
</ul>
<p>
Or use <code>M-x npm-mode-npm-run</code>, <code>M-x npm-mode-npm-install</code>, etc. directly
</p>
</div>
</li>

<li><a id="org62f7b7e"></a>Jest Testing<br />
<div class="outline-text-5" id="text-1-3-3-3">
<ul class="org-ul">
<li><code>C-c t j</code> - Run Jest tests</li>
<li><code>C-c t p</code> - Jest test popup</li>
</ul>
</div>
</li>

<li><a id="org629c959"></a>JavaScript Import<br />
<div class="outline-text-5" id="text-1-3-3-4">
<ul class="org-ul">
<li><code>C-c i i</code> - Import module</li>
<li><code>C-c i f</code> - Import from file</li>
</ul>
</div>
</li>

<li><a id="org7dd68e0"></a>Indium Debugging<br />
<div class="outline-text-5" id="text-1-3-3-5">
<ul class="org-ul">
<li><code>C-c C-b</code> - Toggle breakpoint</li>
<li><code>C-c C-c</code> - Evaluate function</li>
<li><code>C-c C-e</code> - Evaluate expression</li>
<li><code>C-c C-r</code> - Evaluate region</li>
<li><code>C-c C-l</code> - List breakpoints</li>
</ul>
</div>
</li>

<li><a id="orgab5b0fb"></a>Skewer (Live Development)<br />
<div class="outline-text-5" id="text-1-3-3-6">
<ul class="org-ul">
<li><code>C-c C-k</code> - Load buffer to browser</li>
<li><code>C-c C-e</code> - Evaluate expression in browser</li>
<li><code>C-c C-r</code> - Evaluate region in browser</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org2b5caa8" class="outline-4">
<h4 id="org2b5caa8"><span class="section-number-4">1.3.4.</span> Workflow Examples</h4>
<div class="outline-text-4" id="text-1-3-4">
</div>
<ol class="org-ol">
<li><a id="org57fb66d"></a>Starting a React/Next.js Project<br />
<div class="outline-text-5" id="text-1-3-4-1">
<ol class="org-ol">
<li>Open project in Emacs</li>
<li><code>M-x npm-mode-npm-install</code> (or <code>C-c n i</code>) to install dependencies</li>
<li><code>M-x npm-mode-npm-run</code> (or <code>C-c n n</code>) and select "dev" to start dev server</li>
<li>Open .jsx or .tsx files - web-mode will activate automatically</li>
<li>Eglot will connect to typescript-language-server automatically</li>
<li>Prettier will format on save (if enabled in project)</li>
</ol>
</div>
</li>

<li><a id="orgcfdbd09"></a>Debugging with Indium<br />
<div class="outline-text-5" id="text-1-3-4-2">
<ol class="org-ol">
<li>Start your dev server (e.g., <code>npm run dev</code>)</li>
<li><code>M-x indium-launch</code> to start Chrome with debugging enabled</li>
<li>Set breakpoints with <code>C-c C-b</code></li>
<li>Interact with page, debugger will pause at breakpoints</li>
<li>Evaluate expressions in context with <code>C-c C-e</code></li>
</ol>
</div>
</li>

<li><a id="org46f7928"></a>Live Development with Skewer<br />
<div class="outline-text-5" id="text-1-3-4-3">
<ol class="org-ol">
<li><code>M-x run-skewer</code> to start the server</li>
<li>Open <code>http://localhost:8080</code> in browser</li>
<li>Edit HTML/CSS/JS files</li>
<li><code>C-c C-k</code> to instantly reload changes in browser</li>
</ol>
</div>
</li>

<li><a id="org86a5830"></a>Testing APIs with restclient<br />
<div class="outline-text-5" id="text-1-3-4-4">
<ol class="org-ol">
<li>Create a .rest file</li>
<li><p>
Write HTTP requests:
</p>
<pre class="example" id="org2b2d392">
GET https://api.example.com/users
Content-Type: application/json

###

POST https://api.example.com/users
Content-Type: application/json

{
  "name": "John Doe",
  "email": "john@example.com"
}
</pre></li>
<li><code>C-c C-c</code> on a request to execute it</li>
</ol>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgc2fa64f" class="outline-4">
<h4 id="orgc2fa64f"><span class="section-number-4">1.3.5.</span> Project Structure Recommendations</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
For optimal Emacs integration, use these files in your projects:
</p>
</div>

<ol class="org-ol">
<li><a id="org27da50a"></a>.prettierrc.json<br />
<div class="outline-text-5" id="text-1-3-5-1">
<div class="org-src-container">
<pre class="src src-json">{
  "semi": true,
  "trailingComma": "es5",
  "singleQuote": true,
  "printWidth": 80,
  "tabWidth": 2
}
</pre>
</div>
</div>
</li>

<li><a id="org9dc7f61"></a>.eslintrc.json<br />
<div class="outline-text-5" id="text-1-3-5-2">
<div class="org-src-container">
<pre class="src src-json">{
  "extends": [
    "eslint:recommended",
    "plugin:react/recommended",
    "plugin:@typescript-eslint/recommended",
    "prettier"
  ],
  "parser": "@typescript-eslint/parser",
  "plugins": ["react", "@typescript-eslint"],
  "rules": {
    "react/react-in-jsx-scope": "off"
  }
}
</pre>
</div>
</div>
</li>

<li><a id="org5b5fe93"></a>tsconfig.json (for TypeScript projects)<br />
<div class="outline-text-5" id="text-1-3-5-3">
<div class="org-src-container">
<pre class="src src-json">{
  "compilerOptions": {
    "target": "ES2020",
    "lib": ["ES2020", "DOM"],
    "jsx": "react-jsx",
    "module": "ESNext",
    "moduleResolution": "bundler",
    "strict": true,
    "esModuleInterop": true,
    "skipLibCheck": true
  }
}
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
</main>
</body>
</html>
